src/SSL.Chat2Desk/src/InformationRegisters/C2D_ТранспортыКлиентов/C2D_ТранспортыКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>C2D_ТранспортыКлиентов</name>
  <dimensions>
    <name>client_id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>transport</name>
    <type>
      <types>CatalogRef.C2D_Transports</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/SSL.Chat2Desk/src/InformationRegisters/C2D_Клиенты/C2D_Клиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>C2D_Клиенты</name>
  <resources>
    <name>Клиент</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>avatar</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>assigned_name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>client_phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолноеИмяТипаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/SSL.Chat2Desk/src/InformationRegisters/C2D_ТранспортыКлиентов/ManagerModule.bsl
#Область ПрограммныйИнтерфейс
Процедура ДобавитьТранспортКлиенту(client_id, channel_id, transport) Экспорт
	Запись = РегистрыСведений.C2D_ТранспортыКлиентов.СоздатьМенеджерЗаписи();
	Запись.client_id = client_id;
	Запись.transport = Справочники.C2D_Transports.СоздатьПолучитьТранспорт(transport, channel_id);
	Запись.Записать();
КонецПроцедуры

Процедура ДобавитьТранспортыКлиенту (client_id, МассивКаналов) Экспорт
	Для каждого Канал Из МассивКаналов Цикл
		Если ЗначениеЗаполнено(Канал) Тогда
			channel_id = канал.получить("id");
			Для каждого Транспорт Из канал.Получить("transports") Цикл
				ДобавитьТранспортКлиенту(client_id,channel_id, Транспорт);
			КонецЦикла; 
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

// Функция - Получить возможные транспорты по клиенту
//
// Параметры:
//  СсылкаНаКлиента	 - любая Ссылка	 - ссылка по которой будет совершена попытка поиска доступных транспортов.
// 
// Возвращаемое значение:
//  массив -массив наименований транспортов
//
Функция ПолучитьВозможныеТранспортыПоКлиенту(СсылкаНаКлиента) экспорт
	//для начала найдем id по ссылке
	Массивclient_id = РегистрыСведений.C2D_Клиенты.НайтиIDПоСсылке(СсылкаНаКлиента);
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	C2D_ТранспортыКлиентов.transport КАК transport
	               |ИЗ
	               |	РегистрСведений.C2D_ТранспортыКлиентов КАК C2D_ТранспортыКлиентов
	               |ГДЕ
	               |	C2D_ТранспортыКлиентов.client_id В(&Массивclient_id)";
	Запрос.УстановитьПараметр("Массивclient_id", Массивclient_id);
	
	Возврат запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("transport");
		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
